#![allow(non_camel_case_types, non_snake_case, non_upper_case_globals)]

/* automatically generated by rust-bindgen 0.72.1 */

pub const FMD_TYPE_BOOL: u32 = 0;
pub const FMD_TYPE_INT32: u32 = 1;
pub const FMD_TYPE_UINT32: u32 = 2;
pub const FMD_TYPE_INT64: u32 = 3;
pub const FMD_TYPE_UINT64: u32 = 4;
pub const FMD_TYPE_STRING: u32 = 5;
pub const FMD_TYPE_TIME: u32 = 6;
pub const FMD_TYPE_SIZE: u32 = 7;
pub const FMD_ADM_VERSION: u32 = 1;
pub const FMD_ADM_PROGRAM: u32 = 0;
pub const FMD_ADM_MOD_FAILED: u32 = 1;
pub const FMD_ADM_RSRC_FAULTY: u32 = 1;
pub const FMD_ADM_RSRC_UNUSABLE: u32 = 2;
pub const FMD_ADM_RSRC_INVISIBLE: u32 = 4;
pub const FMD_ADM_SERD_FIRED: u32 = 1;
pub type uint_t = ::std::os::raw::c_uint;
pub type id_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvlist {
    pub nvl_version: i32,
    pub nvl_nvflag: u32,
    pub nvl_priv: u64,
    pub nvl_flag: u32,
    pub nvl_pad: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nvlist"][::std::mem::size_of::<nvlist>() - 24usize];
    ["Alignment of nvlist"][::std::mem::align_of::<nvlist>() - 8usize];
    ["Offset of field: nvlist::nvl_version"][::std::mem::offset_of!(nvlist, nvl_version) - 0usize];
    ["Offset of field: nvlist::nvl_nvflag"][::std::mem::offset_of!(nvlist, nvl_nvflag) - 4usize];
    ["Offset of field: nvlist::nvl_priv"][::std::mem::offset_of!(nvlist, nvl_priv) - 8usize];
    ["Offset of field: nvlist::nvl_flag"][::std::mem::offset_of!(nvlist, nvl_flag) - 16usize];
    ["Offset of field: nvlist::nvl_pad"][::std::mem::offset_of!(nvlist, nvl_pad) - 20usize];
};
pub type nvlist_t = nvlist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fmd_prop {
    pub fmdp_name: *const ::std::os::raw::c_char,
    pub fmdp_type: uint_t,
    pub fmdp_defv: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmd_prop"][::std::mem::size_of::<fmd_prop>() - 24usize];
    ["Alignment of fmd_prop"][::std::mem::align_of::<fmd_prop>() - 8usize];
    ["Offset of field: fmd_prop::fmdp_name"][::std::mem::offset_of!(fmd_prop, fmdp_name) - 0usize];
    ["Offset of field: fmd_prop::fmdp_type"][::std::mem::offset_of!(fmd_prop, fmdp_type) - 8usize];
    ["Offset of field: fmd_prop::fmdp_defv"][::std::mem::offset_of!(fmd_prop, fmdp_defv) - 16usize];
};
pub type fmd_prop_t = fmd_prop;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct fmd_stat {
    pub fmds_name: [::std::os::raw::c_char; 32usize],
    pub fmds_type: uint_t,
    pub fmds_desc: [::std::os::raw::c_char; 64usize],
    pub fmds_value: fmd_stat__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union fmd_stat__bindgen_ty_1 {
    pub bool_: ::std::os::raw::c_int,
    pub i32_: i32,
    pub ui32: u32,
    pub i64_: i64,
    pub ui64: u64,
    pub str_: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmd_stat__bindgen_ty_1"][::std::mem::size_of::<fmd_stat__bindgen_ty_1>() - 8usize];
    ["Alignment of fmd_stat__bindgen_ty_1"]
        [::std::mem::align_of::<fmd_stat__bindgen_ty_1>() - 8usize];
    ["Offset of field: fmd_stat__bindgen_ty_1::bool_"]
        [::std::mem::offset_of!(fmd_stat__bindgen_ty_1, bool_) - 0usize];
    ["Offset of field: fmd_stat__bindgen_ty_1::i32_"]
        [::std::mem::offset_of!(fmd_stat__bindgen_ty_1, i32_) - 0usize];
    ["Offset of field: fmd_stat__bindgen_ty_1::ui32"]
        [::std::mem::offset_of!(fmd_stat__bindgen_ty_1, ui32) - 0usize];
    ["Offset of field: fmd_stat__bindgen_ty_1::i64_"]
        [::std::mem::offset_of!(fmd_stat__bindgen_ty_1, i64_) - 0usize];
    ["Offset of field: fmd_stat__bindgen_ty_1::ui64"]
        [::std::mem::offset_of!(fmd_stat__bindgen_ty_1, ui64) - 0usize];
    ["Offset of field: fmd_stat__bindgen_ty_1::str_"]
        [::std::mem::offset_of!(fmd_stat__bindgen_ty_1, str_) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmd_stat"][::std::mem::size_of::<fmd_stat>() - 112usize];
    ["Alignment of fmd_stat"][::std::mem::align_of::<fmd_stat>() - 8usize];
    ["Offset of field: fmd_stat::fmds_name"][::std::mem::offset_of!(fmd_stat, fmds_name) - 0usize];
    ["Offset of field: fmd_stat::fmds_type"][::std::mem::offset_of!(fmd_stat, fmds_type) - 32usize];
    ["Offset of field: fmd_stat::fmds_desc"][::std::mem::offset_of!(fmd_stat, fmds_desc) - 36usize];
    ["Offset of field: fmd_stat::fmds_value"]
        [::std::mem::offset_of!(fmd_stat, fmds_value) - 104usize];
};
pub type fmd_stat_t = fmd_stat;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fmd_adm {
    _unused: [u8; 0],
}
pub type fmd_adm_t = fmd_adm;
unsafe extern "C" {
    pub fn fmd_adm_open(
        arg1: *const ::std::os::raw::c_char,
        arg2: u32,
        arg3: ::std::os::raw::c_int,
    ) -> *mut fmd_adm_t;
}
unsafe extern "C" {
    pub fn fmd_adm_close(arg1: *mut fmd_adm_t);
}
unsafe extern "C" {
    pub fn fmd_adm_errmsg(arg1: *mut fmd_adm_t) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fmd_adm_stats {
    pub ams_buf: *mut fmd_stat_t,
    pub ams_len: uint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmd_adm_stats"][::std::mem::size_of::<fmd_adm_stats>() - 16usize];
    ["Alignment of fmd_adm_stats"][::std::mem::align_of::<fmd_adm_stats>() - 8usize];
    ["Offset of field: fmd_adm_stats::ams_buf"]
        [::std::mem::offset_of!(fmd_adm_stats, ams_buf) - 0usize];
    ["Offset of field: fmd_adm_stats::ams_len"]
        [::std::mem::offset_of!(fmd_adm_stats, ams_len) - 8usize];
};
pub type fmd_adm_stats_t = fmd_adm_stats;
unsafe extern "C" {
    pub fn fmd_adm_stats_read(
        arg1: *mut fmd_adm_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut fmd_adm_stats_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fmd_adm_stats_free(
        arg1: *mut fmd_adm_t,
        arg2: *mut fmd_adm_stats_t,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fmd_adm_modinfo {
    pub ami_name: *const ::std::os::raw::c_char,
    pub ami_desc: *const ::std::os::raw::c_char,
    pub ami_vers: *const ::std::os::raw::c_char,
    pub ami_flags: uint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmd_adm_modinfo"][::std::mem::size_of::<fmd_adm_modinfo>() - 32usize];
    ["Alignment of fmd_adm_modinfo"][::std::mem::align_of::<fmd_adm_modinfo>() - 8usize];
    ["Offset of field: fmd_adm_modinfo::ami_name"]
        [::std::mem::offset_of!(fmd_adm_modinfo, ami_name) - 0usize];
    ["Offset of field: fmd_adm_modinfo::ami_desc"]
        [::std::mem::offset_of!(fmd_adm_modinfo, ami_desc) - 8usize];
    ["Offset of field: fmd_adm_modinfo::ami_vers"]
        [::std::mem::offset_of!(fmd_adm_modinfo, ami_vers) - 16usize];
    ["Offset of field: fmd_adm_modinfo::ami_flags"]
        [::std::mem::offset_of!(fmd_adm_modinfo, ami_flags) - 24usize];
};
pub type fmd_adm_modinfo_t = fmd_adm_modinfo;
pub type fmd_adm_module_f = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const fmd_adm_modinfo_t,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn fmd_adm_module_iter(
        arg1: *mut fmd_adm_t,
        arg2: fmd_adm_module_f,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fmd_adm_module_load(
        arg1: *mut fmd_adm_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fmd_adm_module_unload(
        arg1: *mut fmd_adm_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fmd_adm_module_reset(
        arg1: *mut fmd_adm_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fmd_adm_module_stats(
        arg1: *mut fmd_adm_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut fmd_adm_stats_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fmd_adm_module_gc(
        arg1: *mut fmd_adm_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fmd_adm_rsrcinfo {
    pub ari_fmri: *const ::std::os::raw::c_char,
    pub ari_uuid: *const ::std::os::raw::c_char,
    pub ari_case: *const ::std::os::raw::c_char,
    pub ari_flags: uint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmd_adm_rsrcinfo"][::std::mem::size_of::<fmd_adm_rsrcinfo>() - 32usize];
    ["Alignment of fmd_adm_rsrcinfo"][::std::mem::align_of::<fmd_adm_rsrcinfo>() - 8usize];
    ["Offset of field: fmd_adm_rsrcinfo::ari_fmri"]
        [::std::mem::offset_of!(fmd_adm_rsrcinfo, ari_fmri) - 0usize];
    ["Offset of field: fmd_adm_rsrcinfo::ari_uuid"]
        [::std::mem::offset_of!(fmd_adm_rsrcinfo, ari_uuid) - 8usize];
    ["Offset of field: fmd_adm_rsrcinfo::ari_case"]
        [::std::mem::offset_of!(fmd_adm_rsrcinfo, ari_case) - 16usize];
    ["Offset of field: fmd_adm_rsrcinfo::ari_flags"]
        [::std::mem::offset_of!(fmd_adm_rsrcinfo, ari_flags) - 24usize];
};
pub type fmd_adm_rsrcinfo_t = fmd_adm_rsrcinfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fmd_adm_caseinfo {
    pub aci_uuid: *const ::std::os::raw::c_char,
    pub aci_code: *const ::std::os::raw::c_char,
    pub aci_url: *const ::std::os::raw::c_char,
    pub aci_event: *mut nvlist_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmd_adm_caseinfo"][::std::mem::size_of::<fmd_adm_caseinfo>() - 32usize];
    ["Alignment of fmd_adm_caseinfo"][::std::mem::align_of::<fmd_adm_caseinfo>() - 8usize];
    ["Offset of field: fmd_adm_caseinfo::aci_uuid"]
        [::std::mem::offset_of!(fmd_adm_caseinfo, aci_uuid) - 0usize];
    ["Offset of field: fmd_adm_caseinfo::aci_code"]
        [::std::mem::offset_of!(fmd_adm_caseinfo, aci_code) - 8usize];
    ["Offset of field: fmd_adm_caseinfo::aci_url"]
        [::std::mem::offset_of!(fmd_adm_caseinfo, aci_url) - 16usize];
    ["Offset of field: fmd_adm_caseinfo::aci_event"]
        [::std::mem::offset_of!(fmd_adm_caseinfo, aci_event) - 24usize];
};
pub type fmd_adm_caseinfo_t = fmd_adm_caseinfo;
pub type fmd_adm_rsrc_f = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const fmd_adm_rsrcinfo_t,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type fmd_adm_case_f = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const fmd_adm_caseinfo_t,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn fmd_adm_rsrc_count(
        arg1: *mut fmd_adm_t,
        arg2: ::std::os::raw::c_int,
        arg3: *mut u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fmd_adm_rsrc_iter(
        arg1: *mut fmd_adm_t,
        arg2: ::std::os::raw::c_int,
        arg3: fmd_adm_rsrc_f,
        arg4: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fmd_adm_rsrc_flush(
        arg1: *mut fmd_adm_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fmd_adm_rsrc_repaired(
        arg1: *mut fmd_adm_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fmd_adm_rsrc_replaced(
        arg1: *mut fmd_adm_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fmd_adm_rsrc_acquit(
        arg1: *mut fmd_adm_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fmd_adm_case_repair(
        arg1: *mut fmd_adm_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fmd_adm_case_acquit(
        arg1: *mut fmd_adm_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fmd_adm_case_iter(
        arg1: *mut fmd_adm_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: fmd_adm_case_f,
        arg4: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fmd_adm_serdinfo {
    pub asi_name: *const ::std::os::raw::c_char,
    pub asi_delta: u64,
    pub asi_n: u64,
    pub asi_t: u64,
    pub asi_count: uint_t,
    pub asi_flags: uint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmd_adm_serdinfo"][::std::mem::size_of::<fmd_adm_serdinfo>() - 40usize];
    ["Alignment of fmd_adm_serdinfo"][::std::mem::align_of::<fmd_adm_serdinfo>() - 8usize];
    ["Offset of field: fmd_adm_serdinfo::asi_name"]
        [::std::mem::offset_of!(fmd_adm_serdinfo, asi_name) - 0usize];
    ["Offset of field: fmd_adm_serdinfo::asi_delta"]
        [::std::mem::offset_of!(fmd_adm_serdinfo, asi_delta) - 8usize];
    ["Offset of field: fmd_adm_serdinfo::asi_n"]
        [::std::mem::offset_of!(fmd_adm_serdinfo, asi_n) - 16usize];
    ["Offset of field: fmd_adm_serdinfo::asi_t"]
        [::std::mem::offset_of!(fmd_adm_serdinfo, asi_t) - 24usize];
    ["Offset of field: fmd_adm_serdinfo::asi_count"]
        [::std::mem::offset_of!(fmd_adm_serdinfo, asi_count) - 32usize];
    ["Offset of field: fmd_adm_serdinfo::asi_flags"]
        [::std::mem::offset_of!(fmd_adm_serdinfo, asi_flags) - 36usize];
};
pub type fmd_adm_serdinfo_t = fmd_adm_serdinfo;
pub type fmd_adm_serd_f = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const fmd_adm_serdinfo_t,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn fmd_adm_serd_iter(
        arg1: *mut fmd_adm_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: fmd_adm_serd_f,
        arg4: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fmd_adm_serd_reset(
        arg1: *mut fmd_adm_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
pub type fmd_adm_xprt_f =
    ::std::option::Option<unsafe extern "C" fn(arg1: id_t, arg2: *mut ::std::os::raw::c_void)>;
unsafe extern "C" {
    pub fn fmd_adm_xprt_iter(
        arg1: *mut fmd_adm_t,
        arg2: fmd_adm_xprt_f,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fmd_adm_xprt_stats(
        arg1: *mut fmd_adm_t,
        arg2: id_t,
        arg3: *mut fmd_adm_stats_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fmd_adm_log_rotate(
        arg1: *mut fmd_adm_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
